{
    "tfjs": {
        "name": "Indonesia ID Card and Face",
        "type": "object-detection",
        "u": "510f0ee9a6528c66994d814fefe19320829a942b",
        "allowCache": 0,
        "icon": "dwNi6VPD8Eh9nzPQaUfRa4YyO4z2/ZywcbXt9CNPpCxdLOCYf",
        "iconHasAnnotation": false,
        "annotation": "idCards-faces",
        "size": 640,
        "classes": [
            "ktp",
            "wajah"
        ],
        "colors": {
            "idCards-faces": "#C7FC00",
            "ktp": "#C7FC00",
            "idCards": "#8622FF",
            "faces": "#FE0056",
            "wajah": "#8622FF"
        },
        "model": {
            "format": "graph-model",
            "generatedBy": "2.19.0",
            "convertedBy": "Roboflow",
            "signature": {
                "inputs": {
                    "images": {
                        "name": "images:0",
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [
                                {
                                    "size": "1"
                                },
                                {
                                    "size": "3"
                                },
                                {
                                    "size": "640"
                                },
                                {
                                    "size": "640"
                                }
                            ]
                        }
                    }
                },
                "outputs": {
                    "output_0": {
                        "name": "Identity:0",
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [
                                {
                                    "size": "1"
                                },
                                {
                                    "size": "6"
                                },
                                {
                                    "size": "8400"
                                }
                            ]
                        }
                    }
                }
            },
            "modelTopology": {
                "node": [
                    {
                        "name": "ConstantFolding/PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.math.divide/truediv_recip",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {}
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_167",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "unknown_168",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.strided_slice_19/ones_like",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "unknown_171",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "2"
                                            },
                                            {
                                                "size": "8400"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_172",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "2"
                                            },
                                            {
                                                "size": "8400"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_164",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "unknown_165",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.strided_slice_16/StridedSlice/strides",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.reshape_11/Reshape/shape",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "4"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.compat.v1.transpose_82/transpose/perm",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "4"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.compat.v1.transpose_83/transpose/perm",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "4"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "unknown_166",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "16"
                                            },
                                            {
                                                "size": "1"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.compat.v1.transpose_88/transpose/perm",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "4"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.reshape_14/Reshape/shape",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "unknown_169",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "unknown_170",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.strided_slice_18/ones_like",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT64",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT64"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.concat_20/concat/axis",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {}
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.math.multiply_480/Mul",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "8400"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_133",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_139",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_145",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_151",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_157",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_162",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_132",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_138",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_144",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_150",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_156",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "2"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_163",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "2"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.concat_10/concat/axis",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {}
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.compat.v1.transpose_49/transpose/perm",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "4"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.reshape_2/Reshape/shape",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_INT32"
                            }
                        }
                    },
                    {
                        "name": "unknown_131",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "128"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_137",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_143",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_149",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_155",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_160",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_130",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "128"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_136",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_142",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "3"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_148",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "64"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_154",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "1"
                                            },
                                            {
                                                "size": "64"
                                            },
                                            {
                                                "size": "2"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "unknown_161",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_FLOAT",
                                    "tensorShape": {
                                        "dim": [
                                            {
                                                "size": "2"
                                            }
                                        ]
                                    }
                                }
                            },
                            "dtype": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    {
                        "name": "PartitionedCall/PartitionedCall/PartitionedCall/model_13/tf.concat_13/concat/axis",
                        "op": "Const",
                        "attr": {
                            "value": {
                                "tensor": {
                                    "dtype": "DT_INT32",
                                    "tensorShape": {}
                                }
                            },
                            "dtype": {
